abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_display.c
  current_state.is_infoscreen = false;
  current_state.image.image_hash = 0;
  current_state.image.image_size = 0;
  current_state.image.image_idx = -1;
  current_state.overlay_flags = 0;
}

void oepl_display_show_image(size_t img_idx)
{
  oepl_stored_image_hdr_t img_meta;
  uint32_t img_addr;
  oepl_nvm_status_t nvm_status = oepl_nvm_read_image_metadata(img_idx, &img_meta);
  if(nvm_status != NVM_SUCCESS) {
    DPRINTF("NVM metadata error during display update\n");
    return;
  }

  if(!current_state.is_infoscreen &&
     img_meta.md5 == current_state.image.image_hash &&
     img_meta.size == current_state.image.image_size &&
     requested_overlay_flags == current_state.overlay_flags) {
    DPRINTF("Requested image and overlays are already on screen\n");
    return;
  }

  if(!img_meta.is_valid) {
    DPRINTF("Image was not marked valid\n");
    return;
  }

  nvm_status = oepl_nvm_get_image_raw_address(img_idx, &img_addr);
  if(nvm_status != NVM_SUCCESS) {
    DPRINTF("Couldn't get image address\n");
    return;
  }

  C_flushDrawItems();
  C_drawFlashFullscreenImageWithType(img_addr, img_meta.image_format, img_meta.size);
  add_overlays(requested_overlay_flags);

  DPRINTF("Showing image in slot %d\n", img_idx);

  is_drawing = true;
  driver->draw();
  is_drawing = false;

  current_state.image.image_hash = img_meta.md5;
  current_state.image.image_size = img_meta.size;
  current_state.image.image_idx = img_idx;
  current_state.overlay_flags = requested_overlay_flags;
  current_state.is_infoscreen = false;
}

void oepl_display_show_infoscreen(oepl_display_infoscreen_t screen)
{
  if(current_state.is_infoscreen &&
     current_state.infoscreen == screen &&
     requested_overlay_flags == current_state.overlay_flags) {
    // Already displaying this content
    DPRINTF("Already displaying this info screen\n");
    return;
  }

  // Find out if we have a stored image for this info screen
  uint8_t imgtype;
  switch(screen) {
    case INFOSCREEN_DEEPSLEEP:
      imgtype = CUSTOM_IMAGE_LONGTERMSLEEP;
      break;
    case INFOSCREEN_BOOT:
      imgtype = CUSTOM_IMAGE_SPLASHSCREEN;
      break;
    case INFOSCREEN_PROVISIONING:
    case INFOSCREEN_KIOSK_DEFAULT:
      imgtype = 0xFF;
      break;
    case INFOSCREEN_BOOT_FOUND_AP:
      imgtype = CUSTOM_IMAGE_APFOUND;
      break;
    case INFOSCREEN_LONG_SCAN:
      imgtype = CUSTOM_IMAGE_NOAPFOUND;
      break;
    case INFOSCREEN_LOST_CONNECTION:
      imgtype = CUSTOM_IMAGE_LOST_CONNECTION;
      break;
    case INFOSCREEN_FWU:
      imgtype = 0xFF;
      break;
    case INFOSCREEN_WAKEUP_BUTTON1:
      imgtype = CUSTOM_IMAGE_BUTTON1;
      break;
    case INFOSCREEN_WAKEUP_BUTTON2:
      imgtype = CUSTOM_IMAGE_BUTTON2;
      break;
    case INFOSCREEN_WAKEUP_GPIO:
      imgtype = CUSTOM_IMAGE_GPIO;
      break;
    case INFOSCREEN_WAKEUP_NFC:
      imgtype = CUSTOM_IMAGE_NFC_WAKE;
      break;
    case INFOSCREEN_WAKEUP_RFWAKE:
      imgtype = CUSTOM_IMAGE_RF_WAKE;
      break;
  }

  size_t override_imgidx, img_size;
  oepl_stored_image_hdr_t override_meta;
  DPRINTF("Checking for image ID 0x%x\n", imgtype);
  if(oepl_nvm_get_image_by_type(imgtype, &override_imgidx, &img_size) == NVM_SUCCESS &&
     oepl_nvm_read_image_metadata(override_imgidx, &override_meta) == NVM_SUCCESS &&
     override_meta.is_valid) {
    DPRINTF("Found at idx 0x%x\n", override_imgidx);
    oepl_display_diag_log_show("show stored override", screen, (int)override_imgidx);
    oepl_display_show_image(override_imgidx);
    return;
  } else if(imgtype != 0xFF) {
    DPRINTF("No valid stored override for image ID 0x%x\n", imgtype);
  }

  oepl_display_diag_log_show("render", screen, -1);
  DPRINTF("Not found, reverting to rendering\n");
  // Fell through, create our own screen
  C_flushDrawItems();

  switch(screen) {
    case INFOSCREEN_DEEPSLEEP:
      add_rendered_content_deepsleep();
      break;
    case INFOSCREEN_BOOT:
      add_rendered_content_splash();
      break;
    case INFOSCREEN_PROVISIONING:
      add_rendered_content_provisioning();
      break;
    case INFOSCREEN_BOOT_FOUND_AP:
      add_rendered_content_ap_found();
      break;
    case INFOSCREEN_LONG_SCAN:
      add_rendered_content_ap_not_found();
      break;
    case INFOSCREEN_LOST_CONNECTION:
      add_rendered_content_ap_not_found();
      break;
    case INFOSCREEN_FWU:
      add_rendered_content_fwu();
      break;
    case INFOSCREEN_WAKEUP_BUTTON1:
      // Fallthrough
    case INFOSCREEN_WAKEUP_BUTTON2:
      // Fallthrough
    case INFOSCREEN_WAKEUP_GPIO:
      // Fallthrough
    case INFOSCREEN_WAKEUP_NFC:
      // Fallthrough
    case INFOSCREEN_WAKEUP_RFWAKE:
      // Wakeup events aren't rendered - they're only shown if a custom image is present
      return;
    case INFOSCREEN_KIOSK_DEFAULT:
      add_rendered_content_kiosk_default();
      break;
  }

  add_overlays(requested_overlay_flags);
  is_drawing = true;
  driver->draw();
  is_drawing = false;
  current_state.overlay_flags = requested_overlay_flags;
  current_state.is_infoscreen = true;
  current_state.infoscreen = screen;
}

void oepl_display_set_overlay(oepl_display_overlay_t overlay, bool show)
{
  uint32_t mask = 0;
  uint8_t overlay_enabled = 1;
  switch(overlay) {
    case ICON_NOT_CONNECTED:
      mask = OVERLAY_FLAG_NOT_CONNECTED;
      if(oepl_nvm_setting_get(OEPL_ENABLE_NORF_ICON, &overlay_enabled, sizeof(overlay_enabled)) != NVM_SUCCESS) {
        // Default to showing overlays
        overlay_enabled = 1;
      }
      break;
    case ICON_LOW_BATTERY:
      mask = OVERLAY_FLAG_LOW_BATTERY;
      if(oepl_nvm_setting_get(OEPL_ENABLE_LOWBAT_ICON, &overlay_enabled, sizeof(overlay_enabled)) != NVM_SUCCESS) {
        // Default to showing overlays
        overlay_enabled = 1;
      }
      break;
  }

  DPRINTF("%s overlay mask 0x%08x\n", overlay_enabled > 0 ? show ? "Set" : "Clear" : "Disabled", mask);

  if(show && (overlay_enabled > 0)) {
    requested_overlay_flags |= mask;
  } else {
    requested_overlay_flags &= ~mask;
  }
}

bool oepl_display_is_drawing(void)
{
  return is_drawing;
}

