abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_display.c
void oepl_display_draw(oepl_display_draw_done_cb_t cb)
{
  // Todo: async display updates
  (void)cb;
  if(current_state.is_infoscreen) {
    oepl_display_show_infoscreen(current_state.infoscreen);
  } else if(current_state.image.image_idx >= 0) {
    oepl_display_show_image((size_t)current_state.image.image_idx);
  }
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
static void add_overlays(uint32_t overlay_mask)
{
  if(overlay_mask & OVERLAY_FLAG_LOW_BATTERY) {
    C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_BLACK);
    if (num_colors >= 3) {
      C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_RED);
      C_drawRoundedRectangle(xres - 28, yres - 26, 24, 24, COLOR_RED);
    } else {
      C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_BLACK);
      C_drawRoundedRectangle(xres - 28, yres - 26, 24, 24, COLOR_BLACK);
    }
    C_addBufferedImage(xres - 24, yres - 19, COLOR_BLACK, ROTATE_0, battery, DRAW_NORMAL);
  }

  if(overlay_mask & OVERLAY_FLAG_NOT_CONNECTED) {
    C_drawMask(xres - 28, 4, 24, 24, COLOR_BLACK);
    if (num_colors >= 3) {
      C_drawMask(xres - 28, 4, 24, 24, COLOR_RED);
      C_drawRoundedRectangle(xres - 28, 4, 24, 24, COLOR_RED);
      C_addBufferedImage(xres - 24, 8, COLOR_BLACK, ROTATE_0, ant, DRAW_NORMAL);
      C_addBufferedImage(xres - 16, 15, COLOR_RED, ROTATE_0, cross, DRAW_NORMAL);
    } else {
      C_drawRoundedRectangle(xres - 28, 4, 24, 24, COLOR_BLACK);
      C_addBufferedImage(xres - 24, 8, COLOR_BLACK, ROTATE_0, ant, DRAW_NORMAL);
      C_addBufferedImage(xres - 16, 15, COLOR_BLACK, ROTATE_0, cross, DRAW_NORMAL);
    }
  }
}

#ifndef OEPL_KIOSK_AP_BASE
/* SoftAP portal when phone joins the OEPL hotspot (ESP32 default). No trailing slash. */
#define OEPL_KIOSK_AP_BASE "http://192.168.4.1"
#endif

static void add_rendered_content_provisioning(void)
{
  uint8_t mac[8];
  oepl_radio_get_mac(mac);
  const char *pin = oepl_provision_get_pin();
  /* Version 4 (~65B URL). Scale for scanability on 2.6". */
  const uint8_t qr_ver = 4;
  const uint8_t qr_scale = (xres >= 360 && yres >= 184) ? 3 : 2;
  const uint16_t qr_px = (uint16_t)((17 + 4 * qr_ver) * qr_scale);
  const uint16_t qr_x = (xres > qr_px + 4) ? (uint16_t)(xres - qr_px - 4) : 0;
  const uint16_t qr_y = 4;

  C_epdSetFont(&FreeSansBold18pt7b);
  C_epdPrintf(5, 5, COLOR_BLACK, ROTATE_0, "Setup PIN");
  C_epdSetFont(&FreeSansBold24pt7b);
  C_epdPrintf(5, 45, COLOR_RED, ROTATE_0, "%s", pin);
  C_epdSetFont(&FreeSans9pt7b);
  C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "Scan QR to program");
  C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "%02X%02X%02X%02X%02X%02X%02X%02X",
              mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  C_addQR(qr_x, qr_y, qr_ver, qr_scale,
          OEPL_KIOSK_AP_BASE "/program.html?mac=%02X%02X%02X%02X%02X%02X%02X%02X&pin=%s",
          mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7], pin);
}

static void add_rendered_content_splash(void)
{
  uint8_t hwid = oepl_hw_get_hwid();
  uint8_t mac[8];
  oepl_radio_get_mac(mac);
  uint16_t fw = oepl_hw_get_swversion();
  const char* suffix = oepl_hw_get_swsuffix();
  switch (hwid) {
    case SOLUM_M3_PEGHOOK_BWR_13:
      // Fallthrough
    case SOLUM_M3_BWR_16:
    case SOLUM_M3_BWRY_16:
    case SOLUM_M3_BWRY_16_HIGHRES:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      if (hwid == SOLUM_M3_PEGHOOK_BWR_13) {
        C_epdPrintf(2, 38, COLOR_RED, ROTATE_0, "Newton M3 1.3 Peghook\"");
      } else {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 1.6\"");
      }
      if (hwid == SOLUM_M3_BWRY_16 || hwid == SOLUM_M3_BWRY_16_HIGHRES) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(2, yres - 20, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_22:
    case SOLUM_M3_BWRY_22:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.2\"");
      if (hwid == SOLUM_M3_BWRY_22) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_22_LITE:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.2\" LITE");
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BW_26: {
      const uint16_t logo_w = (uint16_t)dc34_logo[0] | ((uint16_t)dc34_logo[1] << 8);
      const uint16_t logo_x = (xres > logo_w) ? (uint16_t)((xres - logo_w) / 2) : 0;
      C_addFlashImage(logo_x, 6, COLOR_BLACK, ROTATE_0, dc34_logo);
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(5, yres - 52, COLOR_BLACK, ROTATE_0, "Triple-tap button for PIN");
      C_epdPrintf(5, yres - 36, COLOR_BLACK, ROTATE_0, "Enter PIN to program");
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      break;
    }
    case SOLUM_M3_BWR_26:
    case SOLUM_M3_BWRY_26:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_26) {
		  C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.6\"");
      } else if(hwid == SOLUM_M3_BWRY_26) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 BWRY 2.6\"");
        C_epdPrintf(10, 58, COLOR_YELLOW, ROTATE_0, "Yellow");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 2.6 Freezer\"");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_29:
      // Fallthrough
    case SOLUM_M3_BW_29:
    case SOLUM_M3_BWRY_29:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_29) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.9\"");
      } else if(hwid == SOLUM_M3_BWRY_29) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 BWRY 2.9\"");
        C_epdPrintf(10, 58, COLOR_YELLOW, ROTATE_0, "Yellow");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 2.9 Freezer\"");
      }
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_42:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, 1, ROTATE_0, "Newton M3 4.2\"");
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 120, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_43:
    case SOLUM_M3_BWRY_43:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      if(hwid == SOLUM_M3_BWRY_43) {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 BWRY 4.3\"");
      } else {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 4.3\"");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 32, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BW_58:
      // Fallthrough
    case SOLUM_M3_BWR_58:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_58) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 5.85\"");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 5.85\" Freezer");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_60:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(15, 60, 1, ROTATE_0, "Newton M3 6.0\"");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(293, 61, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(40, 120, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_75:
    case SOLUM_M3_BWRY_75:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      if(hwid == SOLUM_M3_BWRY_75) {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 BWRY 7.5\"");
      } else {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 7.5\"");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(420, 81, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(100, 160, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_97:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 9.7\"");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 37, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(220, 420, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(260, 160, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    default:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      if (num_colors >= 3) {
        C_epdPrintf(2, 38, COLOR_RED, ROTATE_0, "EFR32xG22 ID 0x%02X", hwid);
      } else {
        C_epdPrintf(2, 38, COLOR_BLACK, ROTATE_0, "EFR32xG22 ID 0x%02X", hwid);
      }
      if (num_colors >= 4) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(2, yres - 20, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[5], mac[6], mac[7]);
      break;
  }
}

