abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_display.c
static void add_rendered_content_ap_found(void)
{
  int8_t rssi, temperature = -127;
  uint8_t lqi;
  uint8_t APmac[8], mac[8];
  uint8_t currentChannel;
  uint8_t hwid = oepl_hw_get_hwid();
  uint16_t mv = 0;
  bool accentcolor = num_colors >= 3 ? COLOR_RED : COLOR_BLACK;

  if(!oepl_radio_get_ap_link(&currentChannel, APmac, &lqi, &rssi)) {
    rssi = -127;
    lqi = 0;
    currentChannel = 0;
    memset(APmac, 0, sizeof(APmac));
  }

  oepl_hw_get_temperature(&temperature);
  oepl_hw_get_voltage(&mv, false);

  oepl_radio_get_mac(mac);

  // Start with largest screen layout and work our way down to smallest
  if(xres >= 600 && yres >= 480) {
    // Layout for 6" and above is the same
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found - Waiting for data");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(15, 55, accentcolor, ROTATE_0, "AP: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(15, 73, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(270, 55, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 792 && yres >= 272) {
    // 5.8" (weird aspect ratio)
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, 53, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(10, 71, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(10, 89, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 522 && yres >= 122) {
    // 4.3" (weird aspect ratio)
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found - Waiting for data");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(15, 55, accentcolor, ROTATE_0, "AP: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(15, 73, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(270, 55, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 400 && yres >= 300) {
    // 4.2"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, 53, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(10, 71, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(10, 89, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 360 && yres >= 184) {
    // 2.6"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, 53, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(10, 71, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(10, 89, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 284 && yres >= 168) {
    // 2.9"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, 53, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(10, 71, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(10, 89, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else if(xres >= 296 && yres >= 160) {
    // 2.2"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, 53, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(10, 71, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(10, 89, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(10, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  } else {
    // Anything smaller
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(7, 6, COLOR_BLACK, ROTATE_0, "AP Found");
    C_epdPrintf(0, 24, accentcolor, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", APmac[7], APmac[6], APmac[5], APmac[4], APmac[3], APmac[2], APmac[1], APmac[0]);
    C_epdPrintf(5, 42, accentcolor, ROTATE_0, "RSSI: %ddBm    LQI: %d", rssi, lqi);
    C_epdPrintf(5, 60, accentcolor, ROTATE_0, "Ch %d", currentChannel);
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(5, yres - 43, COLOR_BLACK, ROTATE_0, "Battery: %d.%02dV Temp: %d'C", mv / 1000, (mv % 1000)/10, temperature);
    C_epdPrintf(0, yres - 25, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
  }
}

static void add_rendered_content_ap_not_found(void)
{
  uint8_t hwid = oepl_hw_get_hwid();
  uint8_t mac[8];
  oepl_radio_get_mac(mac);

