abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_display.c
  // Start with largest screen layout and work our way down to smallest
  if(xres >= 960 && yres >= 672) {
    // 9.7"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found          U_U");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 39, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 58, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 77, COLOR_BLACK, ROTATE_0, "can force a retry now by scanning");
    C_epdPrintf(10, 98, COLOR_BLACK, ROTATE_0, "the NFC-wake area with your phone");
    C_addFlashImage(200, 128, COLOR_BLACK, ROTATE_0, pandablack);
    C_addFlashImage(312, 274, COLOR_RED, ROTATE_0, pandared);
  } else if(xres >= 880 && yres >= 528) {
    // 7.5"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found          U_U");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 39, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 58, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 77, COLOR_BLACK, ROTATE_0, "can force a retry now by pressing a button");
    C_addFlashImage(200, 128, COLOR_BLACK, ROTATE_0, pandablack);
    C_addFlashImage(312, 274, COLOR_RED, ROTATE_0, pandared);
  } else if(xres >= 600 && yres >= 480) {
    // 6"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found          U_U");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 39, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 58, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 77, COLOR_BLACK, ROTATE_0, "can force a retry now by pressing a button");
    C_addFlashImage(0, 96, COLOR_BLACK, ROTATE_0, pandablack);
    C_addFlashImage(112, 242, COLOR_RED, ROTATE_0, pandared);
  } else if(xres >= 792 && yres >= 272) {
    // 5.8" (weird aspect ratio)
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 69, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 89, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(152, 109, COLOR_BLACK, ROTATE_0, "can force a retry now by scanning");
    C_epdPrintf(152, 129, COLOR_BLACK, ROTATE_0, "the NFC-wake area with your phone");
  } else if(xres >= 522 && yres >= 122) {
    // 4.3" (weird aspect ratio)
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found          UwU");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_drawRoundedRectangle(36, 55, 112, 42, COLOR_RED);
    C_epdPrintf(44, 61, COLOR_BLACK, ROTATE_0, "NFC WAKE");
    C_epdPrintf(41, 77, COLOR_BLACK, ROTATE_0, "SCAN HERE");

    C_epdPrintf(152, 49, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(152, 69, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(152, 89, COLOR_BLACK, ROTATE_0, "can force a retry now by scanning");
    C_epdPrintf(152, 109, COLOR_BLACK, ROTATE_0, "the NFC-wake area with your phone");
  } else if(xres >= 400 && yres >= 300) {
    // 4.2"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 69, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 89, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 109, COLOR_BLACK, ROTATE_0, "can force a retry now by pressing a button");
  } else if(xres >= 360 && yres >= 184) {
    // 2.6"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 69, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 89, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 109, COLOR_BLACK, ROTATE_0, "can force a retry now by scanning");
    C_epdPrintf(10, 129, COLOR_BLACK, ROTATE_0, "the NFC-wake area with your phone");
  } else if(xres >= 284 && yres >= 168) {
    // 2.9"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 69, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 89, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 109, COLOR_BLACK, ROTATE_0, "can force a retry now by pressing a button");
  } else if(xres >= 296 && yres >= 160) {
    // 2.2"
    C_epdSetFont(&FreeSansBold18pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "No AP Found");
    C_epdSetFont(&FreeSans9pt7b);
    C_addQR(xres - 66, 47, 3, 2, "https://openepaperlink.eu/tag/1/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
    C_epdPrintf(10, 69, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
    C_epdPrintf(10, 89, COLOR_BLACK, ROTATE_0, "I'll try again in a little while, but you");
    C_epdPrintf(10, 109, COLOR_BLACK, ROTATE_0, "can force a retry now by pressing a button");
  } else {
    // Anything smaller
    C_epdSetFont(&FreeSans9pt7b);
    C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "NO AP Found");
    C_epdPrintf(2, 25, COLOR_BLACK, ROTATE_0, "Couldn't find an AP :(");
  }
}

static void add_rendered_content_deepsleep(void)
{
  C_epdSetFont(&FreeSansBold24pt7b);
  C_epdPrintf((xres / 2) - 12, (yres / 2) - 12, COLOR_BLACK, ROTATE_0, "zZz");
}

static void add_rendered_content_fwu(void)
{
  C_epdSetFont(&FreeSansBold24pt7b);
  C_epdPrintf((xres / 2) - 12, (yres / 2) - 12, COLOR_BLACK, ROTATE_0, "FWU");
}

static void add_checkerboard_background(uint16_t tile_px)
{
  if (tile_px < 24) {
    tile_px = 24;
  }
  for (uint16_t y = 0; y < yres; y += tile_px) {
    uint16_t th = tile_px;
    if (y + th > yres) {
      th = (uint16_t)(yres - y);
    }
    for (uint16_t x = 0; x < xres; x += tile_px) {
      uint16_t tw = tile_px;
      if (x + tw > xres) {
        tw = (uint16_t)(xres - x);
      }
      bool alt = (((x / tile_px) + (y / tile_px)) & 1) == 0;
      if (alt) {
        C_drawMask(x, y, tw, th, COLOR_BLACK);
      } else if (num_colors >= 3) {
        C_drawMask(x, y, tw, th, COLOR_RED);
      }
    }
  }
}

static void add_rendered_content_kiosk_default(void)
{
  uint8_t mac[8];
  uint16_t fw = oepl_hw_get_swversion();
  const char* suffix = oepl_hw_get_swsuffix();
  oepl_radio_get_mac(mac);

  /* Text-only boot screen — no drawMask tiles (calloc failures = blank display). */
  C_epdSetFont(&FreeSansBold18pt7b);
  C_epdPrintf(5, 5, COLOR_BLACK, ROTATE_0, "Kiosk");
  C_epdSetFont(&FreeSans9pt7b);
  C_epdPrintf(5, 35, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
  if (num_colors >= 3) {
    C_epdPrintf(5, 55, COLOR_RED, ROTATE_0, "2.6\" BWRY");
  }
  C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
  C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
              mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
}

void oepl_display_show_kiosk_default(void)
{
  oepl_display_show_infoscreen(INFOSCREEN_KIOSK_DEFAULT);
}
